## Цель работы: 
1. Создать репозиторий
2. Сделать коммит
3. Добавить удалённый репозиторий
4. Запушить локальные коммиты в удалённый репозиторий

# Создаем папку ТП по структуре: 

git init - для инициализации репозитория (создает в текущей директории гит-репозиторий (скрытую папку .git с базой данных и метаданными))

git status - просмотр, какой статус имеет каждый файл в проекте. 
Так как мы пока не добавляли файлы в индекс и не коммитили, их статус будет edited:

git add . - добавление всех файлов проекта в индекс, чтобы они были добавлены в будущий коммит (точка в конце обозначает добавление всех файлов)

git config - добавление информации о себе: имя и почта 

git commit - создание коммитов 
git log - просмотр истории коммитов в репозитории

